# Проект SQL - исследование данных об инвестиции венчурных фондов в компании-стартапы

**Цель проекта:**

Сделать различные выгрузки данных с базы. 


**Описание проекта**

Проект был пройден в тренажере, правильность запросов обоснована, работа идет с базой данных, которая хранит информациб о венчурных фондах и инвестициях.

**Инструменты**

- PostgreSQL
- Подзапросы, JOIN-соединения

**Описание данных**

`acquisition`

Содержит информацию о покупках одних компаний другими.
Таблица включает такие поля:

- первичный ключ id — идентификатор или уникальный номер покупки;
- внешний ключ acquiring_company_id — ссылается на таблицу company — идентификатор компании-покупателя, то есть той, что покупает другую компанию;
- внешний ключ acquired_company_id — ссылается на таблицу company — идентификатор компании, которую покупают;
- term_code — способ оплаты сделки:
    - cash — наличными;
    - stock — акциями компании;
    - cash_and_stock — смешанный тип оплаты: наличные и акции.
- price_amount — сумма покупки в долларах;
- acquired_at — дата совершения сделки;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`company`

Содержит информацию о компаниях-стартапах.

- первичный ключ id — идентификатор, или уникальный номер компании;
- name — название компании;
- category_code — категория деятельности компании, например:
    - news — специализируется на работе с новостями;
    - social — специализируется на социальной работе.
- status — статус компании:
    - acquired — приобретена;
    - operating — действует;
    - ipo — вышла на IPO;
    - closed — перестала существовать.
- founded_at — дата основания компании;
- closed_at — дата закрытия компании, которую указывают в том случае, если компании больше не существует;
- domain — домен сайта компании;
- twitter_username — название профиля компании в твиттере;
- country_code — код страны, например, USA для США, GBR для Великобритании;
- investment_rounds — число раундов, в которых компания участвовала как инвестор;
- funding_rounds — число раундов, в которых компания привлекала инвестиции;
- funding_total — сумма привлечённых инвестиций в долларах;
- milestones — количество важных этапов в истории компании;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`education`

Хранит информацию об уровне образования сотрудников компаний.

- первичный ключ id — уникальный номер записи с информацией об образовании;
- внешний ключ person_id — ссылается на таблицу people — идентификатор человека, информация о котором представлена в записи;
- degree_type — учебная степень, например:
    - BA — Bachelor of Arts — бакалавр гуманитарных наук;
    - MS — Master of Science — магистр естественных наук.
- instituition — учебное заведение, название университета;
- graduated_at — дата завершения обучения, выпуска;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`fund`

Хранит информацию о венчурных фондах. 

- первичный ключ id — уникальный номер венчурного фонда;
- name — название венчурного фонда;
- founded_at — дата основания фонда;
- domain — домен сайта фонда;
- twitter_username — профиль фонда в твиттере;
- country_code — код страны фонда;
- investment_rounds — число инвестиционных раундов, в которых фонд принимал участие;
- invested_companies — число компаний, в которые инвестировал фонд;
- milestones — количество важных этапов в истории фонда;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`funding_round`

Содержит информацию о раундах инвестиций. 

- первичный ключ id — уникальный номер инвестиционного раунда;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании, участвовавшей в инвестиционном раунде;
- funded_at — дата проведения раунда;
- funding_round_type — тип инвестиционного раунда, например:
    - venture — венчурный раунд;
    - angel — ангельский раунд;
    - series_a — раунд А.
- raised_amount — сумма инвестиций, которую привлекла компания в этом раунде в долларах;
- pre_money_valuation — предварительная, проведённая до инвестиций оценка стоимости компании в долларах;
- participants — количество участников инвестиционного раунда;
- is_first_round — является ли этот раунд первым для компании;
- is_last_round — является ли этот раунд последним для компании;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`investment`

Содержит информацию об инвестициях венчурных фондов в компании-стартапы.

- первичный ключ id — уникальный номер инвестиции;
- внешний ключ funding_round_id — ссылается на таблицу funding_round — уникальный номер раунда инвестиции;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа, в которую инвестируют;
- внешний ключ fund_id — ссылается на таблицу fund — уникальный номер фонда, инвестирующего в компанию-стартап;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---
`people`

Содержит информацию о сотрудниках компаний-стартапов.

- первичный ключ id — уникальный номер сотрудника;
- first_name — имя сотрудника;
- last_name — фамилия сотрудника;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа;
- twitter_username — профиль сотрудника в твиттере;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

## Задание 1 
Посчитайть, сколько компаний закрылось.

In [34]:
'''
SELECT 
      COUNT(status)
FROM
      company
WHERE
      status LIKE ('%closed%')
'''

"\nSELECT \n      COUNT(status)\nFROM\n      company\nWHERE\n      status LIKE ('%closed%')\n"

## Задание 2 
Отобразите количество привлечённых средств для новостных компаний США. Используйте данные из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total .

In [35]:
'''
SELECT 
      funding_total
FROM
      company
WHERE
      category_code = 'news'
  AND country_code = 'USA'
ORDER BY 
      funding_total DESC;
'''

"\nSELECT \n      funding_total\nFROM\n      company\nWHERE\n      category_code = 'news'\n  AND country_code = 'USA'\nORDER BY \n      funding_total DESC;\n"

## Задание 3 
Найдите общую сумму сделок по покупке одних компаний другими в долларах. Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.

In [36]:
'''
SELECT 
      SUM(price_amount)
FROM 
      acquisition
WHERE
      EXTRACT(YEAR FROM CAST(acquired_at AS timestamp)) BETWEEN 2011 AND 2013
  AND term_code = 'cash'
'''

"\nSELECT \n      SUM(price_amount)\nFROM \n      acquisition\nWHERE\n      EXTRACT(YEAR FROM CAST(acquired_at AS timestamp)) BETWEEN 2011 AND 2013\n  AND term_code = 'cash'\n"

## Задание 4 
Отобразите имя, фамилию и названия аккаунтов людей в твиттере, у которых названия аккаунтов начинаются на 'Silver'.

In [37]:
'''
SELECT
      first_name,
      last_name,
      twitter_username
FROM 
      people
WHERE
      twitter_username LIKE 'Silver%'
'''

"\nSELECT\n      first_name,\n      last_name,\n      twitter_username\nFROM \n      people\nWHERE\n      twitter_username LIKE 'Silver%'\n"

## Задание 5 
Выведите на экран всю информацию о людях, у которых названия аккаунтов в твиттере содержат подстроку 'money', а фамилия начинается на 'K'.

In [38]:
'''
SELECT *
FROM 
      people
WHERE
      twitter_username LIKE '%money%' 
  AND last_name LIKE 'K%'
'''

"\nSELECT *\nFROM \n      people\nWHERE\n      twitter_username LIKE '%money%' \n  AND last_name LIKE 'K%'\n"

## Задание 6 
Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы.

In [39]:
'''
SELECT 
      country_code,
      SUM(funding_total)
FROM
      company
GROUP BY 
      country_code
ORDER BY 
      SUM(funding_total) DESC;
'''

'\nSELECT \n      country_code,\n      SUM(funding_total)\nFROM\n      company\nGROUP BY \n      country_code\nORDER BY \n      SUM(funding_total) DESC;\n'

## Задание 7 
Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, привлечённых в эту дату.Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю и не равно максимальному значению.

In [40]:
'''
SELECT 
      funded_at,
      MIN(raised_amount),
      MAX(raised_amount)
FROM
      funding_round
GROUP BY
      funded_at
HAVING 
      MIN(raised_amount) != 0
  AND MIN(raised_amount) != MAX(raised_amount);
'''

'\nSELECT \n      funded_at,\n      MIN(raised_amount),\n      MAX(raised_amount)\nFROM\n      funding_round\nGROUP BY\n      funded_at\nHAVING \n      MIN(raised_amount) != 0\n  AND MIN(raised_amount) != MAX(raised_amount);\n'

## Задание 8 
Создайте поле с категориями:
- Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
- Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
- Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.


Отобразите все поля таблицы fund и новое поле с категориями.

In [41]:
'''
SELECT 
     *,
      CASE
          WHEN invested_companies < 20 THEN 'low_activity'
          WHEN invested_companies < 100 THEN 'middle_activity'
          WHEN invested_companies >= 100 THEN 'high_activity'
       END   
          
FROM 
      fund;
'''

"\nSELECT \n     *,\n      CASE\n          WHEN invested_companies < 20 THEN 'low_activity'\n          WHEN invested_companies < 100 THEN 'middle_activity'\n          WHEN invested_companies >= 100 THEN 'high_activity'\n       END   \n          \nFROM \n      fund;\n"

## Задание 9

Для каждой из категорий, назначенных в предыдущем задании, посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, в которых фонд принимал участие. Выведите на экран категории и среднее число инвестиционных раундов. Отсортируйте таблицу по возрастанию среднего.

In [42]:
'''
SELECT 
       CASE
           WHEN invested_companies>=100 THEN 'high_activity'
           WHEN invested_companies>=20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity,
       ROUND(AVG(investment_rounds))
       
FROM fund

GROUP BY 
      activity
ORDER BY
      AVG(investment_rounds) ASC;
'''

"\nSELECT \n       CASE\n           WHEN invested_companies>=100 THEN 'high_activity'\n           WHEN invested_companies>=20 THEN 'middle_activity'\n           ELSE 'low_activity'\n       END AS activity,\n       ROUND(AVG(investment_rounds))\n       \nFROM fund\n\nGROUP BY \n      activity\nORDER BY\n      AVG(investment_rounds) ASC;\n"

## Задание 10

Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 
Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны, основанные с 2010 по 2012 год включительно. Исключите страны с фондами, у которых минимальное число компаний, получивших инвестиции, равно нулю. 
Выгрузите десять самых активных стран-инвесторов: отсортируйте таблицу по среднему количеству компаний от большего к меньшему. Затем добавьте сортировку по коду страны в лексикографическом порядке.

In [43]:
'''
SELECT 
      country_code,
      MIN(invested_companies),
      MAX(invested_companies),
      AVG(invested_companies)      
      
FROM fund     
WHERE
      EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) BETWEEN 2010 AND 2012
GROUP BY  
      country_code 
HAVING
      MIN(invested_companies) != 0
ORDER BY 
      AVG(invested_companies) DESC,
      country_code ASC
LIMIT 10;
'''

'\nSELECT \n      country_code,\n      MIN(invested_companies),\n      MAX(invested_companies),\n      AVG(invested_companies)      \n      \nFROM fund     \nWHERE\n      EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) BETWEEN 2010 AND 2012\nGROUP BY  \n      country_code \nHAVING\n      MIN(invested_companies) != 0\nORDER BY \n      AVG(invested_companies) DESC,\n      country_code ASC\nLIMIT 10;\n'

## Задание 11

Отобразите имя и фамилию всех сотрудников стартапов. Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

In [44]:
'''
SELECT 
     people.first_name,
     people.last_name,
     education.instituition
     
FROM
     people LEFT JOIN education ON people.id=education.person_id;
'''

'\nSELECT \n     people.first_name,\n     people.last_name,\n     education.instituition\n     \nFROM\n     people LEFT JOIN education ON people.id=education.person_id;\n'

## Задание 12

Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. Выведите название компании и число уникальных названий учебных заведений. Составьте топ-5 компаний по количеству университетов.

In [45]:
'''
SELECT
       c.name,
       COUNT(DISTINCT e.instituition)
  
FROM
      education AS e 
      JOIN people AS p 
                       ON e.person_id = p.id
      JOIN company AS c 
                       ON p.company_id = c.id
      
GROUP BY 
      c.name

ORDER BY 
       COUNT(e.instituition) DESC
       
LIMIT 5;
'''

'\nSELECT\n       c.name,\n       COUNT(DISTINCT e.instituition)\n  \nFROM\n      education AS e \n      JOIN people AS p \n                       ON e.person_id = p.id\n      JOIN company AS c \n                       ON p.company_id = c.id\n      \nGROUP BY \n      c.name\n\nORDER BY \n       COUNT(e.instituition) DESC\n       \nLIMIT 5;\n'

## Задание 12

Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [46]:
'''
SELECT 
      DISTINCT(name)
FROM
      company
WHERE 
      id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
'''

"\nSELECT \n      DISTINCT(name)\nFROM\n      company\nWHERE \n      id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\n"

## Задание 13

Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [47]:
'''
SELECT 
      DISTINCT(name)
FROM
      company
WHERE 
      id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
'''

"\nSELECT \n      DISTINCT(name)\nFROM\n      company\nWHERE \n      id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\n"

## Задание 14

Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

In [48]:
'''
SELECT 
      DISTINCT(p.id)
FROM
      company AS c JOIN people AS p ON c.id = p.company_id
WHERE 
      c.id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
'''

"\nSELECT \n      DISTINCT(p.id)\nFROM\n      company AS c JOIN people AS p ON c.id = p.company_id\nWHERE \n      c.id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\n"

## Задание 15

Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением, которое окончил сотрудник.

In [49]:
'''
SELECT 
      DISTINCT(p.id),
      e.instituition
FROM
      company AS c JOIN people AS p ON c.id = p.company_id
                   JOIN education AS e ON p.id = e.person_id
WHERE 
      c.id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
'''

"\nSELECT \n      DISTINCT(p.id),\n      e.instituition\nFROM\n      company AS c JOIN people AS p ON c.id = p.company_id\n                   JOIN education AS e ON p.id = e.person_id\nWHERE \n      c.id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\n"

## Задание 16

Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды.

In [50]:
'''
SELECT 
      p.id,
      COUNT(e.instituition)
FROM
      company AS c JOIN people AS p ON c.id = p.company_id
                   JOIN education AS e ON p.id = e.person_id
WHERE 
      c.id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
GROUP BY
      p.id;
'''

"\nSELECT \n      p.id,\n      COUNT(e.instituition)\nFROM\n      company AS c JOIN people AS p ON c.id = p.company_id\n                   JOIN education AS e ON p.id = e.person_id\nWHERE \n      c.id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\nGROUP BY\n      p.id;\n"

## Задание 17

Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники разных компаний. Нужно вывести только одну запись, группировка здесь не понадобится.

In [51]:
'''
SELECT
      AVG(c_e)

FROM
(SELECT 
      p.id,
      COUNT(e.instituition) AS c_e
FROM
      company AS c JOIN people AS p ON c.id = p.company_id
                   JOIN education AS e ON p.id = e.person_id
WHERE 
      c.id IN (SELECT 
             company_id
       FROM 
             funding_round
       WHERE 
             is_first_round = 1
         AND is_last_round = 1)
AND status = 'closed'
GROUP BY
      p.id) AS t;
'''

"\nSELECT\n      AVG(c_e)\n\nFROM\n(SELECT \n      p.id,\n      COUNT(e.instituition) AS c_e\nFROM\n      company AS c JOIN people AS p ON c.id = p.company_id\n                   JOIN education AS e ON p.id = e.person_id\nWHERE \n      c.id IN (SELECT \n             company_id\n       FROM \n             funding_round\n       WHERE \n             is_first_round = 1\n         AND is_last_round = 1)\nAND status = 'closed'\nGROUP BY\n      p.id) AS t;\n"

## Задание 18


Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники Facebook*.
*(сервис, запрещённый на территории РФ)

In [52]:
'''
SELECT
      AVG(c_e)
FROM (SELECT 
       p.id,
       COUNT(e.instituition) AS c_e
FROM
       company AS c JOIN people AS p ON c.id = p.company_id
                    JOIN education AS e ON p.id = e.person_id
WHERE 
       c.name = 'Facebook'
GROUP BY
       p.id) AS T;
'''

"\nSELECT\n      AVG(c_e)\nFROM (SELECT \n       p.id,\n       COUNT(e.instituition) AS c_e\nFROM\n       company AS c JOIN people AS p ON c.id = p.company_id\n                    JOIN education AS e ON p.id = e.person_id\nWHERE \n       c.name = 'Facebook'\nGROUP BY\n       p.id) AS T;\n"

## Задание 19


Составьте таблицу из полей:
- name_of_fund — название фонда;
- name_of_company — название компании;
- amount — сумма инвестиций, которую привлекла компания в раунде.


В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, а раунды финансирования проходили с 2012 по 2013 год включительно.

In [53]:
'''
SELECT f.name AS name_of_fund,
c.name AS name_of_company,
fr.raised_amount AS amount
FROM investment AS i
LEFT JOIN company AS c ON c.id = i.company_id
LEFT JOIN fund AS f ON i.fund_id = f.id
INNER JOIN 
(SELECT*
FROM funding_round
WHERE funded_at BETWEEN '2012-01-01' AND '2013-12-31')
AS fr ON fr.id = i.funding_round_id
WHERE c.milestones > 6;
'''

"\nSELECT f.name AS name_of_fund,\nc.name AS name_of_company,\nfr.raised_amount AS amount\nFROM investment AS i\nLEFT JOIN company AS c ON c.id = i.company_id\nLEFT JOIN fund AS f ON i.fund_id = f.id\nINNER JOIN \n(SELECT*\nFROM funding_round\nWHERE funded_at BETWEEN '2012-01-01' AND '2013-12-31')\nAS fr ON fr.id = i.funding_round_id\nWHERE c.milestones > 6;\n"

## Задание 20

Выгрузите таблицу, в которой будут такие поля:
- название компании-покупателя;
- сумма сделки;
- название компании, которую купили;
- сумма инвестиций, вложенных в купленную компанию;
- доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, округлённая до ближайшего целого числа.

Не учитывайте те сделки, в которых сумма покупки равна нулю. Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 
Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке. Ограничьте таблицу первыми десятью записями.

In [54]:
'''
WITH
sell AS (
         SELECT
              acquisition.id AS P,
              company.name AS first,
              acquisition.price_amount AS second
         FROM acquisition
                         LEFT JOIN company ON acquisition.acquiring_company_id = company.id
         WHERE acquisition.price_amount != 0),
   
   
buy AS (
        SELECT
             acquisition.id AS P,
             company.name AS third,
             company.funding_total AS forth
        FROM acquisition
                        LEFT JOIN company ON acquisition.acquired_company_id = company.id
        WHERE company.funding_total != 0)
        
SELECT
     sell.first,
     sell.second,
     buy.third,
     buy.forth,
     ROUND(second / forth)

FROM
     sell JOIN buy ON sell.P = buy.P
ORDER BY 
     second DESC,
     third ASC
LIMIT 10
'''

'\nWITH\nsell AS (\n         SELECT\n              acquisition.id AS P,\n              company.name AS first,\n              acquisition.price_amount AS second\n         FROM acquisition\n                         LEFT JOIN company ON acquisition.acquiring_company_id = company.id\n         WHERE acquisition.price_amount != 0),\n   \n   \nbuy AS (\n        SELECT\n             acquisition.id AS P,\n             company.name AS third,\n             company.funding_total AS forth\n        FROM acquisition\n                        LEFT JOIN company ON acquisition.acquired_company_id = company.id\n        WHERE company.funding_total != 0)\n        \nSELECT\n     sell.first,\n     sell.second,\n     buy.third,\n     buy.forth,\n     ROUND(second / forth)\n\nFROM\n     sell JOIN buy ON sell.P = buy.P\nORDER BY \n     second DESC,\n     third ASC\nLIMIT 10\n'

## Задание 21

Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год включительно. Проверьте, что сумма инвестиций не равна нулю. Выведите также номер месяца, в котором проходил раунд финансирования.

In [55]:
'''
SELECT
      c.name,
      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp))
FROM 
      company AS c 
                  JOIN funding_round AS fr ON c.id = fr.company_id
WHERE
      EXTRACT(YEAR FROM CAST(fr.funded_at AS timestamp)) BETWEEN 2010 AND 2013
  AND fr.raised_amount != 0
  AND c.category_code = 'social' 
'''

"\nSELECT\n      c.name,\n      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp))\nFROM \n      company AS c \n                  JOIN funding_round AS fr ON c.id = fr.company_id\nWHERE\n      EXTRACT(YEAR FROM CAST(fr.funded_at AS timestamp)) BETWEEN 2010 AND 2013\n  AND fr.raised_amount != 0\n  AND c.category_code = 'social' \n"

## Задание 22

Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды. Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:
- номер месяца, в котором проходили раунды;
- количество уникальных названий фондов из США, которые инвестировали в этом месяце;
- количество компаний, купленных за этот месяц;
- общая сумма сделок по покупкам в этом месяце.

In [56]:
'''
WITH 

one AS (SELECT
      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp)) AS month,
      COUNT(DISTINCT f.name) AS second
FROM
      fund AS f
               JOIN investment AS i ON f.id = i.fund_id
               JOIN funding_round AS fr ON i.funding_round_id = fr.id
               
WHERE
      EXTRACT(YEAR FROM CAST(fr.funded_at AS timestamp)) BETWEEN 2010 AND 2013
  AND country_code = 'USA'
  
GROUP BY 
      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp))),
      
      
two AS (
    SELECT
              COUNT(acquired_company_id) AS third,
              SUM(price_amount) AS forth,
              EXTRACT(MONTH FROM CAST(acquired_at AS timestamp)) AS month
        FROM
              acquisition

        WHERE
              EXTRACT(YEAR FROM CAST(acquired_at AS timestamp)) BETWEEN 2010 AND 2013

        GROUP BY 
              EXTRACT(MONTH FROM CAST(acquired_at AS timestamp)))
              
SELECT
      one.month,
      one.second,
      two.third,
      two.forth
      
FROM one 
        JOIN two ON one.month = two.month
'''

"\nWITH \n\none AS (SELECT\n      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp)) AS month,\n      COUNT(DISTINCT f.name) AS second\nFROM\n      fund AS f\n               JOIN investment AS i ON f.id = i.fund_id\n               JOIN funding_round AS fr ON i.funding_round_id = fr.id\n               \nWHERE\n      EXTRACT(YEAR FROM CAST(fr.funded_at AS timestamp)) BETWEEN 2010 AND 2013\n  AND country_code = 'USA'\n  \nGROUP BY \n      EXTRACT(MONTH FROM CAST(fr.funded_at AS timestamp))),\n      \n      \ntwo AS (\n    SELECT\n              COUNT(acquired_company_id) AS third,\n              SUM(price_amount) AS forth,\n              EXTRACT(MONTH FROM CAST(acquired_at AS timestamp)) AS month\n        FROM\n              acquisition\n\n        WHERE\n              EXTRACT(YEAR FROM CAST(acquired_at AS timestamp)) BETWEEN 2010 AND 2013\n\n        GROUP BY \n              EXTRACT(MONTH FROM CAST(acquired_at AS timestamp)))\n              \nSELECT\n      one.month,\n      one.second,\n      two.third,\n      two.forth\n      \nFROM one \n        JOIN two ON one.month = two.month\n"

## Задание 23


Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 2012 и 2013 годах. Данные за каждый год должны быть в отдельном поле. Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

In [57]:
'''
WITH

y_2011 AS (SELECT
      country_code AS country,
      AVG(funding_total) AS a_2011
FROM company           
WHERE
       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2011
       
GROUP BY
       country_code),


y_2012 AS (SELECT
      country_code AS country,
      AVG(funding_total) AS a_2012
FROM company        
WHERE
       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2012

GROUP BY
       country_code),


y_2013 AS (SELECT
      country_code AS country,
      AVG(funding_total) AS a_2013
FROM company          
WHERE
       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2013

GROUP BY
       country_code)


SELECT
       y_2011.country,
       y_2011.a_2011,
       y_2012.a_2012,
       y_2013.a_2013
FROM 
       y_2011 
             JOIN y_2012 ON y_2011.country = y_2012.country
             JOIN y_2013 ON y_2012.country = y_2013.country
             
ORDER BY 
        a_2011 DESC
'''

'\nWITH\n\ny_2011 AS (SELECT\n      country_code AS country,\n      AVG(funding_total) AS a_2011\nFROM company           \nWHERE\n       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2011\n       \nGROUP BY\n       country_code),\n\n\ny_2012 AS (SELECT\n      country_code AS country,\n      AVG(funding_total) AS a_2012\nFROM company        \nWHERE\n       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2012\n\nGROUP BY\n       country_code),\n\n\ny_2013 AS (SELECT\n      country_code AS country,\n      AVG(funding_total) AS a_2013\nFROM company          \nWHERE\n       EXTRACT(YEAR FROM CAST(founded_at AS timestamp)) = 2013\n\nGROUP BY\n       country_code)\n\n\nSELECT\n       y_2011.country,\n       y_2011.a_2011,\n       y_2012.a_2012,\n       y_2013.a_2013\nFROM \n       y_2011 \n             JOIN y_2012 ON y_2011.country = y_2012.country\n             JOIN y_2013 ON y_2012.country = y_2013.country\n             \nORDER BY \n        a_2011 DESC\n'